Repository: ARWNI2S/NI2S-Node
Catalog: src/NI2SNode.Infrastructure/Resources/LocalizedStrings.*.resx
Languages: es_es

# Collections_ArgMustNotBeNegative
source: The argument may not be less than zero.
es_es: El argumento no puede ser menor que cero.

# Collections_ArrayTooSmall
source: The array is too small to hold all of the items.
es_es: La matriz es demasiado pequeña para contener todos los elementos.

# Collections_BadComparandType
source: Comparand is not of the correct type.
es_es: El comparador no es del tipo correcto.

# Collections_CannotModifyCollection
source: The \"{0}\" collection is read-only and cannot be modified.
es_es: La colección \"{0}\" es de solo lectura y no se puede modificar.

# Collections_CapacityLessThanCount
source: The capacity may not be less than Count.
es_es: La capacidad no puede ser inferior a Count.

# Collections_ChangeDuringEnumeration
source: Collection was modified during an enumeration.
es_es: La colección fue modificada durante la enumeración.

# Collections_CollectionIsEmpty
source: The collection is empty.
es_es: La colección está vacía.

# Collections_CollectionIsReadOnly
source: The collection may not be read only.
es_es: La colección no puede ser de solo lectura.

# Collections_CollectionTooLarge
source: The collection has become too large.
es_es: La colección se ha vuelto demasiado grande.

# Collections_IdentityComparerNoCompare
source: The Compare method is not supported on an identity comparer.
es_es: El método Compare no se admite en un comparador de identidad.

# Collections_InconsistentComparisons
source: The two collections cannot be combined because they use different comparison operations.
es_es: Las dos colecciones no se pueden combinar porque usan diferentes operaciones de comparación.

# Collections_InvalidLoadFactor
source: The load factor must be between 0.25 and 0.95.
es_es: El factor de carga debe estar entre 0.25 y 0.95.

# Collections_KeyAlreadyPresent
source: The key was already present in the dictionary.
es_es: La clave ya estaba presente en el diccionario.

# Collections_KeyNotFound
source: The key was not found in the collection.
es_es: La clave no se encontró en la colección.

# Collections_ListIsReadOnly
source: The list may not be read only.
es_es: La lista no puede ser de solo lectura.

# Collections_MustOverrideIndexerGet
source: The get accessor of the indexer must be overridden.
es_es: El descriptor de acceso get del indexador debe sobrecargarse.

# Collections_MustOverrideIndexerSet
source: The set accessor of the indexer must be overridden.
es_es: El descriptor de acceso establecido del indexador debe sobrecargarse.

# Collections_MustOverrideOrReimplement
source: This method must be overridden or re-implemented in the derived class.
es_es: Este método debe sobrecargarse o volver a implementarse en la clase derivada.

# Collections_OutOfViewRange
source: The argument is outside the range of this View.
es_es: El argumento está fuera del rango de esta vista.

# Collections_ResetNotSupported
source: Reset is not supported on this enumerator.
es_es: Reset no es compatible con este enumerador.

# Collections_TypeNotCloneable
source: Type \"{0}\" does not implement ICloneable.
es_es: El tipo \"{0}\" no implementa ICloneable.

# Collections_UncomparableType
source: Type "{0}" does not implement IComparable<{0}> or IComparable.
es_es: El tipo "{0}" no implementa IComparable<{0}> o IComparable.

# Collections_WrongType
source: The value \"{0}\" isn't of type \"{1}\" and can't be used in this generic collection.
es_es: El valor \"{0}\" no es del tipo \"{1}\" y no se puede usar en esta colección genérica.

# CommonStrings_PressAKeyToContinue
source: Please press a key to continue...
es_es: Por favor presione una tecla para continuar...

# CommonStrings_Yes
source: Yes
es_es: Sí

# Debugging_DefaultAssert
source: Asserted condition was false.
es_es: La condición afirmada era falsa.

# Debugging_DefaultAssertFormat
source: Asserted condition by {0} at {1} was false.
es_es: La condición afirmada por {0} en {1} era falsa.

# DomainManager_CreateDomain_Format
source: Creating domain {0}
es_es: Creando dominio {0}

# DomainManager_DomainCreated_Format
source: Domain {0} created. {1}
es_es: Dominio {0} creado. {1}

# DomainManager_Initialize_Format
source: Initializing domain for application {0}
es_es: Inicializando dominio para la aplicación {0}

# DomainManager_IsFullTrust_Format
source: IsFullyTrusted = {0}
es_es: EsTotalmenteConfiable = {0}

# DomainManager_RunMessage_Format
source: Executing {0}
es_es: Ejecutando {0}

# Logger_LogMessageTruncated_Format
source: "{0}. MESSAGE TRUNCATED AT THIS POINT!! Max message size = {1}"
es_es: "{0}. ¡MENSAJE TRUNCADO EN ESTE PUNTO! Tamaño máximo de mensaje = {1}"

# TimerAfterCallbackAsync
source: Completed async task timer callback for timer {0}
es_es: Devolución de llamada del temporizador de tarea asíncrona completada para el temporizador {0}

# TimerAfterCallbackSync
source: Completed sync timer callback for timer {0}
es_es: Devolución de llamada del temporizador de sincronización completada para el temporizador {0}

# TimerBeforeCallbackAsync
source: About to make async task timer callback for timer {0}
es_es: A punto de realizar una devolución de llamada del temporizador de tareas asincrónicas para el temporizador {0}

# TimerBeforeCallbackSync
source: About to make sync timer callback for timer {0}
es_es: A punto de realizar una devolución de llamada del temporizador de sincronización para el temporizador {0}

# TimerChanging
source: Changing timer {0} to dueTime={1} period={2}
es_es: Cambiando el temporizador {0} a dueTime={1} period={2}

# TimerChanging_Creating
source: Creating timer {0} with dueTime={1} period={2}
es_es: Creando el temporizador {0} con dueTime={1} period={2}

# TimerChanging_Queue
source: About to QueueNextTimerTick for timer {0}
es_es: Acerca de QueueNextTimerTick para el temporizador {0}

# TimerNextTick
source: Queued next tick for timer {0} in {1}
es_es: Siguiente tic en cola para el temporizador {0} en {1}

# TimerStopped
source: Timer {0} is now stopped and disposed
es_es: El temporizador {0} ahora está detenido y desechado

# TraceLogger_Assert_FailMessage
source: Assert failed with message =
es_es: La afirmación falló con el mensaje =

# TraceLogger_Assert_Message
source: Internal contract assertion has failed!
es_es: ¡La aserción del contrato interno ha fallado!

# TraceLogger_CheckBulkMessageLimits_Format
source: Log code {0} occurred {1} additional time{2} in the previous {3}
es_es: El código de registro {0} ocurrió {1} tiempo adicional {2} en el {3} anterior

# TraceLogger_ConfigDataMissing
source: No logger config data provided.
es_es: No se proporcionaron datos de configuración del registrador.

# TraceLogger_Fail_ErrorMessage
source: INTERNAL FAILURE! About to crash! Fail message is:
es_es: ¡FALLO INTERNO! ¡A punto de caer! El mensaje de error es:

# TraceLogger_Fail_Message
source: Internal Fail!
es_es: ¡Fallo interno!

# TraceLogger_Fail_UnrecoverableMessage
source: Unrecoverable failure:
es_es: Fallo irrecuperable:

# TraceLogger_Initialize_ArgumentNullException
source: No logger config data provided.
es_es: No se proporcionaron datos de configuración del registrador.

# TraceLogger_LogWithoutBulkingAndTruncating_Format
source: CHUNKED MESSAGE Part {0}: {1}
es_es: MENSAJE PARTIDO Parte {0}: {1}

# TraceLogger_PrintException_Helper_NoExceptionsMesage
source: No LoaderExceptions found
es_es: No se encontraron LoaderExceptions

# TraceLogger_PrintOneException_Format
source: Exc level {0}: {1}: {2}{3}
es_es: Nivel de excepción {0}: {1}: {2}{3}

# TraceLogger_WriteLogMessage_ExceptionFormat
source: "Exception while passing a log message to log consumer. TraceLogger type:{0}, name:{1}, severity:{2}, message:{3}, error code:{4}, message exception:{5}, log consumer exception:{6}"
es_es: Excepción al pasar un mensaje de registro al consumidor de registros. Tipo de TraceLogger:{0}, nombre:{1}, gravedad:{2}, mensaje:{3}, código de error:{4}, excepción de mensaje:{5}, registro de excepción del consumidor:{6}

# TraceLogger_WriteLogMessage_MessageTruncatedText
source: Previous log message was truncated - Max size =
es_es: El mensaje de registro anterior se truncó - Tamaño máximo =
