Repository: ARWNI2S/NI2S-Node
Catalog: src/ARWNI2S.Infrastructure/Collections/Resources/LocalizedStrings.*.resx
Languages: es_es

# Collections_ArgMustNotBeNegative
source: The argument may not be less than zero.
es_es: El argumento puede no ser menor que cero.

# Collections_ArrayTooSmall
source: The array is too small to hold all of the items.
es_es: La matriz es demasiado pequeña para contener todos los elementos.

# Collections_BadComparandType
source: Comparand is not of the correct type.
es_es: El comparante no es del tipo correcto.

# Collections_CannotModifyCollection
source: The \"{0}\" collection is read-only and cannot be modified.
es_es: La colección \"{0}\" es de sólo lectura y no puede ser modificada.

# Collections_CapacityLessThanCount
source: The capacity may not be less than Count.
es_es: Capacity no puede ser menor que Count.

# Collections_ChangeDuringEnumeration
source: Collection was modified during an enumeration.
es_es: La colección fue modificada durante la enumeración.

# Collections_CollectionIsEmpty
source: The collection is empty.
es_es: La colección está vacía.

# Collections_CollectionIsReadOnly
source: The collection may not be read only.
es_es: La colección no puede ser de sólo lectura.

# Collections_CollectionTooLarge
source: The collection has become too large.
es_es: La colección se ha vuelto demasiado grande.

# Collections_IdentityComparerNoCompare
source: The Compare method is not supported on an identity comparer.
es_es: El método de comparación no es soportado en un comparador de identidad.

# Collections_InconsistentComparisons
source: The two collections cannot be combined because they use different comparison operations.
es_es: Las dos colecciones no pueden combinarse debido a que utilizan operaciones de comparación diferentes.

# Collections_InvalidLoadFactor
source: The load factor must be between 0.25 and 0.95.
es_es: El factor de carga debe estar entre 0,25 y 0.95.

# Collections_KeyAlreadyPresent
source: The key was already present in the dictionary.
es_es: La clave ya estaba presente en el diccionario.

# Collections_KeyNotFound
source: The key was not found in the collection.
es_es: No se encontró la clave de la colección.

# Collections_ListIsReadOnly
source: The list may not be read only.
es_es: La lista no puede ser de sólo lectura.

# Collections_MustOverrideIndexerGet
source: The get accessor of the indexer must be overridden.
es_es: El descriptor de acceso get del indizador debe sobrecargarse.

# Collections_MustOverrideIndexerSet
source: The set accessor of the indexer must be overridden.
es_es: El descriptor de acceso set del indizador debe sobrecargarse.

# Collections_MustOverrideOrReimplement
source: This method must be overridden or re-implemented in the derived class.
es_es: Este método se debe sobrecargar o reimplementar en la clase derivada.

# Collections_OutOfViewRange
source: The argument is outside the range of this View.
es_es: El argumento está fuera del rango de esta Vista.

# Collections_ResetNotSupported
source: Reset is not supported on this enumerator.
es_es: Reset no es soportado por este enumerador.

# Collections_TypeNotCloneable
source: Type \"{0}\" does not implement ICloneable.
es_es: El tipo \"{0}\" no implementa ICloneable.

# Collections_UncomparableType
source: Type "{0}" does not implement IComparable<{0}> or IComparable.
es_es: El tipo "{0}" no implementa IComparable <{0}> o IComparable.

# Collections_WrongType
source: The value \"{0}\" isn't of type \"{1}\" and can't be used in this generic collection.
es_es: El valor \"{0}\" no es de tipo \"{1}\" y no puede ser utilizado en esta colección genérica.
